HarleyCoops/workspaceAlbertaSetup/firmware/companion/sdkconfig.defaults
# WorkspaceAlberta Handheld Companion — experiment defaults
# Target: Waveshare ESP32-S3-Touch-AMOLED-1.8 V2
# 16MB flash, 8MB OPI PSRAM. Values aligned with Waveshare
# examples/esp-idf/00_bsp_quickstart/sdkconfig.defaults.

CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y
CONFIG_FREERTOS_HZ=1000

# Octal PSRAM (ESP32-S3R8, 8MB OPI) — MicroLink recommended board
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_RODATA=y
CONFIG_FREERTOS_TASK_CREATE_ALLOW_EXT_MEM=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768

# USB-C on this board is the ESP32-S3 native USB port (Waveshare docs).
# Serial config + idf.py monitor typically appear as /dev/ttyACM0.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# LVGL fonts used by the experiment UI (same set as Waveshare BSP quickstart)
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_18=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_ATTRIBUTE_FAST_MEM_USE_IRAM=y

# WiFi buffers from the original scaffold
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=16
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=64

# Live desk Pi. WiFi is the underlay; Tailscale is the path to the Pi.
# Never commit a Wi-Fi password or Tailscale auth key.
CONFIG_WA_WIFI_SSID="emc2 Members"
CONFIG_WA_WIFI_PASSWORD=""
CONFIG_WA_BRIDGE_HOST="100.106.117.119"
CONFIG_WA_BRIDGE_LAN_HOST="192.168.0.11"
CONFIG_WA_BRIDGE_PORT=8788
CONFIG_WA_TS_HOSTNAME="wa-esp32-amoled"
CONFIG_WA_TS_AUTH_KEY=""
CONFIG_WA_TS_MAGICDNS="wa-pi5-christian-01"
CONFIG_WA_TS_MAGICDNS_FQDN="wa-pi5-christian-01.tail397d4d.ts.net"
CONFIG_WA_SOFTAP_SSID="WA-Companion"
CONFIG_WA_HEALTH_INTERVAL_MS=5000

# MicroLink / TLS (from their README + examples/basic_connect/sdkconfig.defaults)
CONFIG_ESP_TLS_USING_MBEDTLS=y
CONFIG_MBEDTLS_SSL_PROTO_TLS1_2=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_CMN=y
CONFIG_MBEDTLS_CHACHA20_C=y
CONFIG_MBEDTLS_POLY1305_C=y
CONFIG_MBEDTLS_CHACHAPOLY_C=y
CONFIG_MBEDTLS_HKDF_C=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_ESP_TASK_WDT_TIMEOUT_S=30
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=4096
CONFIG_LWIP_MAX_SOCKETS=16
CONFIG_LWIP_SO_RCVBUF=y
CONFIG_LWIP_TCPIP_RECVMBOX_SIZE=64
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_ML_DEVICE_NAME="wa-esp32-amoled"
CONFIG_ML_TAILSCALE_AUTH_KEY=""
CONFIG_ML_ENABLE_CONFIG_HTTPD=n
CONFIG_ML_PRIORITY_PEER_IP="100.106.117.119"
